In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame,Series
from numpy.random import randn

In [8]:
dframe1 = DataFrame(np.arange(8).reshape(2,4), 
                    index = pd.Index(['LA','NYC'],name='city'),
                    columns= pd.Index(['A','B','C','D'],name='letter'))

In [9]:
dframe1

letter  A  B  C  D
city
LA      0  1  2  3
NYC     4  5  6  7

In [12]:
dframe_st = dframe1.stack()
dframe_st

city  letter
LA    A         0
      B         1
      C         2
      D         3
NYC   A         4
      B         5
      C         6
      D         7
dtype: int64

In [14]:
dframe_st.unstack()

/Users/yuvraj/anaconda/lib/python2.7/site-packages/pandas/core/index.py:4281: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  return np.sum(name == np.asarray(self.names)) > 1

letter  A  B  C  D
city
LA      0  1  2  3
NYC     4  5  6  7

In [15]:
dframe_st.unstack('letter')

letter  A  B  C  D
city
LA      0  1  2  3
NYC     4  5  6  7

In [16]:
dframe_st.unstack('city')

city    LA  NYC
letter
A        0    4
B        1    5
C        2    6
D        3    7

In [26]:
ser1 = Series([1,2,3],index=list('XYC'))
ser2 = Series([4,5,6],index=list('XYZ'))

#

In [27]:
ser1

X    1
Y    2
C    3
dtype: int64

In [28]:
ser2

X    4
Y    5
Z    6
dtype: int64

In [29]:
dframe =  pd.concat([ser1,ser2],keys=["Alpha","Beta"])

In [30]:
dframe

Alpha  X    1
       Y    2
       C    3
Beta   X    4
       Y    5
       Z    6
dtype: int64

In [31]:
dframe.unstack()

        C  X  Y   Z
Alpha   3  1  2 NaN
Beta  NaN  4  5   6

In [25]:
dframe.unstack().stack() #removes null

Alpha  A    1
       B    2
       C    3
Beta   X    4
       Y    5
       Z    6
dtype: float64